import 'package:flutter/material.dart';
import 'package:quran_book/resources/colors.dart';
import 'package:quran_book/resources/dimens.dart';
import 'package:quran_book/widgets/easy_text_widget.dart';

class BookReadDetailsPage extends StatefulWidget {
  const BookReadDetailsPage({super.key, required this.title});

  final String title;

  @override
  State<BookReadDetailsPage> createState() => _BookReadDetailsPageState();
}

class _BookReadDetailsPageState extends State<BookReadDetailsPage> {
  final _pageController = PageController();
  int _index = 0;
  final List<String> pageList = [
    'မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။',
    'မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။',
    'မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။',
    'မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။',
    'မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။ မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။ မြန်မာစာစတင် ဖော်ပြရာတွင် ဗုဒ္ဓစာပေများကို ကျောက်စာ၊ မှင်စာများဖြင့် ဇာတ်နိပါတ်၊ ပန်းချီ၊ ပန်းပု များနှင့် အတူ မှင်ဖြင့် ဖော်ပြကြပြီး ကျောက်စာများ ၊ မှင်စာများ စတင် ပေါ်ပေါက်လာခဲ့ရကြောင်း သိရသည်။ နောက်ပိုင်းတွင် ဗုဒ္ဓစာပေ အကြောင်းအရာများကို စကားပြေဖြင့်လည်းကောင်း ကဗျာများဖြင့်လည်းကောင်း ဖွဲ့နွဲလာကြပြီး ဗုဒ္ဓစာပေကို အခြေခံကာ မြန်မာစာပေ အရေးအဖွဲ့ အမျိုးမျိုး ပေါ်ထွန်းလာရကြောင်းသိရသည်။ ပါဠိ၊ ပျူ၊ မွန်၊ မြန်မာ ဟူသော ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။မြန်မာစာ ပေါ်ပေါက်လာပုံကို ပုဂံခေတ် ကျန်စစ်သားမင်း နတ်ရွာစံပြီး ခရစ်နှစ် (၁၁၁၃) ခန့်တွင် ရေးထိုးသော ရာဇကုမာရ်ကျောက်စာသည် သက္ကရာဇ် အခိုင်အမာ ပါသော အစောဆုံး မြန်မာစာ ဖြစ်ကြောင်းသိရသည်။  ဘာသာစကားတို့မှ စကားလုံးများကို မွေးစား သုံးနှုန်းခြင်း၊ ဘာသာပြန်သုံးနှုန်းခြင်းတို့ဖြင့် မြန်မာစကား နှင့် စာပေ ဖွံ့ဖြိုးကြွယ်ဝ လာခဲ့ သည်ဟု ဆိုကြသည်။ ပင်းယခေတ် (၁၃၀၉ ခုနှစ် ခန့် မှ ၁၃၆၀) နှင့် အင်းဝခေတ် (၁၃၆၄ မှ ၁၄၈၆) တစ်လျောက်လုံးတွင် မြန်မာတို့သည် ဗုဒ္ဓစာပေအမွေအနှစ်များကို ပါဠိဘာသာမှ တစ်ဆင့် ဘာသာပြန်ပြုစုလာခဲ့ကြပြီး မြန်မာစာပေအနေနှင့် အရေးအသား အသုံးအနှုန်းများ ခိုင်မြဲစွာ အမြစ်တွယ် ထွန်းကားနေပြီ ဖြစ်သည်။',
  ];

  @override
  void dispose() {
    _pageController.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        actions: [
          IconButton(
            icon: Icon(
              Icons.menu,
            ),
            onPressed: () {
              showModalBottomSheet(
                backgroundColor: Colors.transparent,
                shape: RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(kSP10x),
                ),
                context: context,
                builder: (_) => _MenuBottomOverView(),
              );
            },
          ),
        ],
        centerTitle: true,
        title: EasyTextWidget(
          text: widget.title,
          fontWeight: FontWeight.w600,
        ),
      ),
      body: Padding(
        padding: const EdgeInsets.all(kSP20x),
        child: Column(
          mainAxisSize: MainAxisSize.min,
          children: [
            Expanded(
              child: PageView.builder(
                itemCount: pageList.length,
                controller: _pageController,
                physics: const NeverScrollableScrollPhysics(),
                onPageChanged: (index) {
                  if (mounted) {
                    setState(() {
                      _index = index;
                    });
                  }
                },
                itemBuilder: (_, index) => SingleChildScrollView(
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.start,
                    mainAxisSize: MainAxisSize.min,
                    children: [
                      EasyTextWidget(
                        text: 'စာအုပ်မိတ်ဆက် ${index + 1}',
                        fontWeight: FontWeight.w600,
                      ),
                      const SizedBox(
                        height: kSP20x,
                      ),
                      EasyTextWidget(
                        text: pageList[index],
                        maxLines: 100,
                      ),
                    ],
                  ),
                ),
              ),
            ),
            const SizedBox(
              height: kSP20x,
            ),
            Row(
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
                IconButton(
                  icon: Icon(
                    Icons.arrow_circle_left,
                  ),
                  onPressed: () {
                    if (_index > 0) {
                      if (mounted) {
                        setState(() {
                          _index = _index - 1;
                          _pageController.jumpToPage(_index);
                        });
                      }
                    }
                  },
                ),
                const SizedBox(
                  width: kSP10x,
                ),
                EasyTextWidget(
                  text: '${_index + 1} of ${pageList.length}',
                  fontWeight: FontWeight.w600,
                ),
                const SizedBox(
                  width: kSP10x,
                ),
                IconButton(
                  icon: Icon(
                    Icons.arrow_circle_right,
                  ),
                  onPressed: () {
                    if (_index < pageList.length - 1) {
                      if (mounted) {
                        setState(() {
                          _index = _index + 1;
                          _pageController.jumpToPage(_index);
                        });
                      }
                    }
                  },
                ),
              ],
            ),
          ],
        ),
      ),
    );
  }
}

class _MenuBottomOverView extends StatelessWidget {
  const _MenuBottomOverView();

  @override
  Widget build(BuildContext context) {
    return Container(
      padding: const EdgeInsets.all(kSP20x),
      width: double.infinity,
      margin: const EdgeInsets.all(kSP20x),
      decoration: BoxDecoration(
        borderRadius: BorderRadius.circular(kSP20x),
        color: kAppPrimaryColor,
      ),
      child: Column(
        crossAxisAlignment: CrossAxisAlignment.start,
        mainAxisSize: MainAxisSize.min,
        children: [
          const SizedBox(
            height: kSP20x,
          ),
          EasyTextWidget(
            text: 'စာအုပ်မိတ်ဆက်',
            fontWeight: FontWeight.w600,
            textColor: kWhiteColor,
          ),
          const SizedBox(
            height: kSP20x,
          ),
          EasyTextWidget(
            text: 'စာအုပ်မိတ်ဆက်',
            fontWeight: FontWeight.w600,
            textColor: kWhiteColor,
          ),
          const SizedBox(
            height: kSP20x,
          ),
          EasyTextWidget(
            text: 'စာအုပ်မိတ်ဆက်',
            fontWeight: FontWeight.w600,
            textColor: kWhiteColor,
          ),
          const SizedBox(
            height: kSP20x,
          ),
          EasyTextWidget(
            text: 'စာအုပ်မိတ်ဆက်',
            fontWeight: FontWeight.w600,
            textColor: kWhiteColor,
          ),
          const SizedBox(
            height: kSP20x,
          ),
          EasyTextWidget(
            text: 'စာအုပ်မိတ်ဆက်',
            fontWeight: FontWeight.w600,
            textColor: kWhiteColor,
          ),
          const SizedBox(
            height: kSP20x,
          ),
          EasyTextWidget(
            text: 'စာအုပ်မိတ်ဆက်',
            fontWeight: FontWeight.w600,
            textColor: kWhiteColor,
          ),
          const SizedBox(
            height: kSP20x,
          ),
          EasyTextWidget(
            text: 'စာအုပ်မိတ်ဆက်',
            fontWeight: FontWeight.w600,
            textColor: kWhiteColor,
          ),
        ],
      ),
    );
  }
}
